ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/DataProcessors/vs_Автоизготовление/vs_Автоизготовление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>vs_Автоизготовление</name>
  <attributes>
    <name>ЗаказНаСборку</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исключить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доизготовление</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НаСкладеВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВРезерве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cc2a9ed0-e83e-4ca4-a99c-1b3eefba4d77">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/DataProcessors/vs_Автоизготовление/Forms/СозданиеСерий/Module.bsl
&НаКлиенте
Процедура СерииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СерииПередУдалением(Элемент, Отказ)
    отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
    
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СерииПриИзменении(Элемент)
    
    КопироватьДанныеФормы(Объект,ВладелецФормы.Объект);

КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
    
    ОчиститьСообщения();
    
    Если не ОкНаСервере() тогда
        ОповеститьОВыборе("Ок")
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция  ОкНаСервере()
    отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Серия КАК Серия,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	ТоварыНаСкладахОстатки.Серия.Наименование КАК СерияНаименование
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Серия.Наименование В (&Серия)) КАК ТоварыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Серия",  объект.Серии.Выгрузить().ВыгрузитьКолонку("Серия"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

    для Каждого  стр из объект.Серии цикл
        стр.серия = СокрЛП(стр.серия);
		Если //не Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(стр.Серия),Истина).Пустая() 
			РезультатЗапроса.Найти(стр.Серия,"СерияНаименование") <> Неопределено тогда
            ОбщегоНазначения.СообщитьПользователю("Данная серия уже есть на остатках " + стр.серия,,,,Отказ);
        иначеЕсли стр.Серия = "" тогда
            ОбщегоНазначения.СообщитьПользователю("Не заполнена серия " + стр.номерстроки,,,,Отказ);
        иначеЕсли объект.Серии.найтиСтроки(новый Структура("серия",стр.серия)).количество() > 1 тогда
            ОбщегоНазначения.СообщитьПользователю("Одна серия введена 2 раза " + стр.серия,,,,Отказ);
        КонецЕсли;
    КонецЦикла;
    
    возврат отказ;
    
КонецФункции
